#pragma once
#include <windows.h>
#include <stdio.h>

#define MAX_X 80
#define MAX_Y 23

//-------------------------------------------------------------
// 콘솔 제어를 위한 준비 작업.
//
//-------------------------------------------------------------
void ConsoleInit(void);

//-------------------------------------------------------------
// 콘솔 화면의 커서를 X, Y 좌표로 이동시킨다.
//
//-------------------------------------------------------------
void MoveCursor(int iPosX, int iPosY);

//-------------------------------------------------------------
// 콘솔 화면을 조기화 한다.
//
//-------------------------------------------------------------
void ClearScreen(void);

extern char _ScreenBuffer[MAX_Y][MAX_X];